# 性能分析

## 10.25号

今天学了一天，代码基本没写，但是终于算是对计算执行过程有了更多的理解
这一块主要是东西太多太杂都，全部混在了一起，大概主要是下面三个东西

- 搬运的数据量大小
- 搬运执行原理
- 计算执行原理

### 搬运的数据量大小

首先呢计算在寄存器里，寄存器去哪里找数据呢，就是缓存，
如果缓存里没有，cpu就会去内存搬进缓存，而且是以cacheline的形式从特定起点开始搬包含目标的固定大小的一段数据。（不是以目标点为起点）
这就涉及了数据流量，一次计算需要往缓存搬多少数据。

这里要区分一下，虽然数据是会复用的，虽然是cacheline一块一块搬运的，但是这不影响你知道要把所有节点搬进来吧，也就是最少最少也是8N。
1. cacheline不影响搬运数据量大小，不是打包了数据量就更小了，他是为了减少搬运请求的次数（搬运执行原理）从而提高速度
2. 数据复用真正影响数据量搬运大小，假设无任何复用，那我每一个节点要搬5*8字节，总计也就是原本的5倍

这里我们假设缓存至少能放下足够一行计算的数据（只是假设，实际情况不一定），也就是三行的旧温度，一行新温度。
那么对于第一行来说，读取的数据量就是3 * 8 Nr
考虑到这一行算完了，开始计算下一行，就需要下下一行的数据读取，然后因为缓存移除的原理，会优先移除最长没有用的数据，就把上上行的缓存清掉，搬进来下下行的数据
这时候你就会发现算完新的一行只需要8 * Nr
**最终算到最后一行每个节点都是充分复用，即只要搬进来一次直到有关他的计算全部完成才会移出缓存，那么搬运的数据量就是 8N，每个数据搬一次**

上面是读取的，然后我们来看写入的
其实前面就提到了，我们算一行除了把读取的三行数据放进缓存，还需要把写入新温度的这一行放进了缓存。那么这个读也是8N
最后还需要把改过的新温度从缓存放回内存，写入8N

总计24N，这就是p2当前数值更新稳定计算时的数据流量大小（当前是在我们缓存大小假设下算出的）,一个节点计算一步平均数据量24字节

因此也可以预估，如果网格数量增大到16倍
1. 缓存放不下一整行需要的数据，那么计算时长>16倍
2. 如果之前能放下，现在也能放下，那么≈16倍
3. 如果之前不能放下，现在也不能放下，那么时长就不好说了

### 搬运执行原理

搬运数据除了搬运本身需要时间，搬运的申请也需要时间。
我这里直接复制之前写的了，一看就懂，虽然写的不是完全正确的，思路没啥问题，重点在于cpu运行周期和延迟的理解，其实就是玩图灵完备，计算是有延迟的，因为中间要经过一个又一个逻辑门，周期是cpu的基本最小时间。

"""
那么p2的整个过程
周期01234去要五个地址的东西
周期20 搬过来 cache1，里面有p p-1 p+1，全部拿到数据
周期23 搬过来 cache2，上一行的八个double，拿到数据
周期24 搬过来 cache3，下一行的八个double，拿到数据，计算完成  开始要写入的地址

周期25~29 直接拿到下一个计算的数据，计算完成，要写入的地址

周期30~34直接拿到下一个计算的数据，计算完成，要写入的地址
······
周期40 拿数据
周期41 拿数据
周期42 拿数据
周期43 拿数据
周期44 搬过来cache4，写入的cache，写入结果1
周期45 写入结果2
周期46 写入结果3
周期47 写入结果4
周期48 拿到所有数据，计算结果5，写入结果5

周期49~53 拿到所有数据，计算结果6，写入结果6

周期54~55拿数据
周期56 找新数据
周期 57~58 拿数据
周期 76 搬过来 cache5 当前行的第二个cache，拿到数据，计算完成  写入结果7

周期 77~79 拿数据
周期 80 找数据
周期 81 找数据
周期 100 拿到上一行的第二个cache,cache6，并拿到数据
周期 101 拿到下一行的第二个cache,cache7，并拿到数据，计算完成，找写入地址

至此一行里面的运算过程就写完了
假设缓存只能存下一行计算需要的所有cacheline
在到新的一行时
周期0~3 拿数据
周期4 找数据
周期24 把最上一行的第一个cache，也就是cache2移除，换成新的cache
然后循环往复
"""

### 计算的原理

同上，我直接搬之前写的了，我们假设一周期执行一次乘法一次加法，乘法加法暂时延迟不重要。

周期0：
乘法单元：第一个点的 rc×O
加法单元：可以开始第二个点的 R+L

周期1：
加法单元：第一个点的 U+D
乘法单元：可以开始第二个点的 rc×O

2：
第一个点的 L+R
第二个点的 U+D

3:  第一个点的c算好了 第二个点的a算好了
第一个点的 ry*b
第三个点的 R+L

4: 第一个点的b算好了 第二个点的c算好了
第二个点的 rx*a
第三个点的 U+D

5: 第一个点的a，第二个点的b算好了
第一个点的 rx*a
第四个点的 U+D

6: 第一个点的e，第三个点的a
第二个点的 ry*b
第四个点的 R+L

7: 第二个点的
唉，什么乱七八遭的，不需要考虑那么多，如果数据没瓶颈，那就是每周期算一个乘一个加，一个点总共3乘4加，瓶颈就在加，平均四个周期计算出一个节点一次更新的结果

### 临时总结

至此，我们知道大致三块的脉络，而我们模型下具体耗时呢：
搬数据和计算总有一个慢的，稳定之后快的那个就可以在慢的那个间隙去完成，所以快的等于不耗时间了，这个在计算速度里也有提现，只看算的慢的，快的在间隙中提前就算完了。

假设总更新次数为 IS，cpu频率为 \(f\)，内存带宽为B，可以算出相关时间的下界，也就是最理想情况耗时：

- T搬运 => 24*IS/B
- T计算 >= 4*IS/\(f\)

T >= max(T搬运，T计算)

至此已经差不多了，当然还有补充的就是我前面就知道的SIMD，每次计算同时算俩节点，那么计算效率就翻倍了，平均2周期算出单节点单次更新

还有就是实际cpu模型，我的CPU加法有俩端口P15端口，乘法有俩端口P01，有几个端口就代表一周期最多能执行几次，可以看出他们在P1有重叠，也就是一周期最多就进行三次计算
那么一个节点更新一次需要7FlOPs，平均就是 7/3周期计算完成

还有就是加法延迟2，乘法延迟4，很合理，都在图灵完备里

其实还有别的，也就是第二部分搬数据也是有执行单元的，延迟吞吐都有，但是我累了，我觉得大体已经差不多了。多线程完成了再看看吧。
